// [재귀함수] 피보나치

// 1 1 2 3 5 8 13 21 34

let a = 1;
let b = 1;
for (let i = 0; i < 6; i++) {
  let c = a + b;
  a = b;
  b = c;
}
console.log(b); // 21

function 피보나치(숫자) {
  if (숫자 === 1 || 숫자 === 2) {
    return 1;
  }
  return 피보나치(숫자 - 1) + 피보나치(숫자 - 2);
}
console.log(피보나치(5)); // 5

// 피보나치(5)  피보나치(4) + 피보나치(3)   3 + 2
// 피보나치(4)  피보나치(3) + 피보나치(2)   2 + 1
// 피보나치(3)  피보나치(2) + 피보나치(1)   1 + 1
// 피보나치(2)  피보나치(1)                1
// 피보나치(1)                             1

// f(f(f(f(2)+f(1))+f(2))+f(f(2)+f(1)))
